; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-87)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 - object)
 (:init 
    (arm-empty)
    (clear b23)
    (on b23 b7)
    (on b7 b13)
    (on b13 b3)
    (on b3 b18)
    (on b18 b1)
    (on b1 b24)
    (on b24 b21)
    (on b21 b15)
    (on b15 b14)
    (on b14 b12)
    (on b12 b6)
    (on b6 b9)
    (on b9 b25)
    (on b25 b16)
    (on b16 b10)
    (on b10 b17)
    (on b17 b5)
    (on b5 b2)
    (on b2 b20)
    (on b20 b26)
    (on b26 b22)
    (on b22 b11)
    (on b11 b4)
    (on b4 b19)
    (on b19 b8)
    (on-table b8))
 (:goal (and 
(clear b12) (on b12 b21)
))
)

; plan
1. (unstack b23 b7)
   deleted: (on b23 b7) (clear b23) (arm-empty)
   added: (holding b23) (clear b7)
   goals met: 0 of 2
2. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 0 of 2
3. (unstack b7 b13)
   deleted: (on b7 b13) (clear b7) (arm-empty)
   added: (holding b7) (clear b13)
   goals met: 0 of 2
4. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 2
5. (unstack b13 b3)
   deleted: (on b13 b3) (clear b13) (arm-empty)
   added: (holding b13) (clear b3)
   goals met: 0 of 2
6. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 2
7. (unstack b3 b18)
   deleted: (on b3 b18) (clear b3) (arm-empty)
   added: (holding b3) (clear b18)
   goals met: 0 of 2
8. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 2
9. (unstack b18 b1)
   deleted: (on b18 b1) (clear b18) (arm-empty)
   added: (holding b18) (clear b1)
   goals met: 0 of 2
10. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 2
11. (unstack b1 b24)
   deleted: (on b1 b24) (clear b1) (arm-empty)
   added: (holding b1) (clear b24)
   goals met: 0 of 2
12. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 2
13. (unstack b24 b21)
   deleted: (on b24 b21) (clear b24) (arm-empty)
   added: (holding b24) (clear b21)
   goals met: 0 of 2
14. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 0 of 2
15. (unstack b21 b15)
   deleted: (on b21 b15) (clear b21) (arm-empty)
   added: (holding b21) (clear b15)
   goals met: 0 of 2
16. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 0 of 2
17. (unstack b15 b14)
   deleted: (on b15 b14) (clear b15) (arm-empty)
   added: (holding b15) (clear b14)
   goals met: 0 of 2
18. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 0 of 2
19. (unstack b14 b12)
   deleted: (on b14 b12) (clear b14) (arm-empty)
   added: (holding b14) (clear b12)
   goals met: 1 of 2
20. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 1 of 2
21. (unstack b12 b6)
   deleted: (on b12 b6) (clear b12) (arm-empty)
   added: (holding b12) (clear b6)
   goals met: 0 of 2
22. (stack b12 b21)
   deleted: (clear b21) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b21)
   goals met: 2 of 2
